Repository: rrcastellano/meu-flask
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: es

source: Arquivo CSV sem cabeçalho.
es: Archivo CSV sin encabezado.

source: Cabeçalhos inválidos.
es: Encabezados inválidos.

source: Campo 'data' vazio.
es: Campo 'fecha' vacío.

source: Nenhuma linha válida foi encontrada no CSV.
es: No se encontró ninguna línea válida en el CSV.

source: Login realizado com sucesso!
es: ¡Inicio de sesión exitoso!

source: Credenciais inválidas.
es: Credenciales inválidas.

source: Conta criada com sucesso! Faça login.
es: ¡Cuenta creada con éxito! Inicie sesión.

source: Email já cadastrado.
es: Correo electrónico ya registrado.

source: Você saiu da conta.
es: Has cerrado sesión.

source: Recarga registrada com sucesso!
es: ¡Recarga registrada con éxito!

source: Configurações atualizadas com sucesso!
es: ¡Configuraciones actualizadas con éxito!

source: Campo obrigatório
es: Campo obligatorio

source: Deve ser > 0
es: Debe ser > 0

source: Não pode ser negativo
es: No puede ser negativo

source: Mensagem enviada com sucesso!
es: ¡Mensaje enviado con éxito!

source: Configurações da Conta
es: Configuraciones de la cuenta

source: Preço da Gasolina (R$/litro)
es: Precio de la gasolina ($/litro)

source: Consumo Médio (km/l)
es: Consumo medio (km/l)

source: Salvar Configurações
es: Guardar configuraciones

source: Importar Recargas em Lote
es: Importar recargas en lote

source: Arquivo CSV
es: Archivo CSV

source: O arquivo deve conter as colunas:
es: El archivo debe contener las columnas:

source: Exemplo de CSV
es: Ejemplo de CSV

source: data,kwh,custo,isento,odometro,local,observacoes 2025-11-01,0.0,0.00,TRUE,0,Bought,Starting point 2025-11-02,20.5,15.00,TRUE,12000,Estação A,Recarga rápida 2025-11-10,18.0,13.50,FALSE,12250,Estação B,Recarga normal 2025-11-20,22.3,16.75,TRUE,12500,Estação C,Recarga completa 2025-11-25,19.8,14.90,FALSE,12750,Estação D,Recarga parcial
es: data,kwh,custo,isento,odometro,local,observacoes 2025-11-01,0.0,0.00,TRUE,0,Comprado,Punto inicial 2025-11-02,20.5,15.00,TRUE,12000,Estación A,Recarga rápida 2025-11-10,18.0,13.50,FALSE,12250,Estación B,Recarga normal 2025-11-20,22.3,16.75,TRUE,12500,Estación C,Recarga completa 2025-11-25,19.8,14.90,FALSE,12750,Estación D,Recarga parcial

source: Entre em Contato
es: Contáctenos

source: Dashboard
es: Panel de control

source: Quantidade de recargas registradas no período.
es: Cantidad de recargas registradas en el período.

source: Recargas Isentas
es: Recargas exentas

source: Recargas Pagas
es: Recargas pagadas

source: Recargas pagas.
es: Recargas pagadas.

source: Km Rodados
es: Kilómetros recorridos

source: Diferença entre o último e o primeiro odômetro no período.
es: Diferencia entre el último y el primer odómetro en el período.

source: Somatório de kWh ÷ Total de km × 100.
es: Suma de kWh ÷ Total de km × 100.

source: Custo Médio / kWh
es: Costo medio / kWh

source: Custo total ÷ kWh total.
es: Costo total ÷ kWh total.

source: Custo Médio / Km
es: Costo medio / Km

source: Custo total ÷ km rodados.
es: Costo total ÷ km recorridos.

source: Custo Gasolina / Km
es: Costo gasolina / Km

source: Preço da gasolina ÷ consumo (km/l).
es: Precio de la gasolina ÷ consumo (km/l).

source: Custo Total
es: Costo total

source: Somatório dos custos (inclui isentas).
es: Suma de los costos (incluye exentas).

source: Recargas Isentas (R$)
es: Recargas exentas ($)

source: Somatório do custo com isento.
es: Suma del costo con exento.

source: Recargas Pagas (R$)
es: Recargas pagadas ($)

source: Somatório de kWh (isentas e pagas).
es: Suma de kWh (exentas y pagadas).

source: Economia (Custo)
es: Ahorro (Costo)

source: Custo simulado da gasolina − Custo total.
es: Costo simulado de gasolina − Costo total.

source: Economia (Custo) / Km
es: Ahorro (Costo) / Km

source: Economia total ÷ km rodados.
es: Ahorro total ÷ km recorridos.

source: Economia (Pagas)
es: Ahorro (Pagadas)

source: Custo simulado da gasolina − Custo das recargas pagas.
es: Costo simulado de gasolina − Costo de recargas pagadas.

source: Economia (Pagas) / Km
es: Ahorro (Pagadas) / Km

source: Economia (pagas) ÷ km rodados.
es: Ahorro (pagadas) ÷ km recorridos.

source: Custos por Mês
es: Costos por mes

source: Valores Economizados por Mês
es: Valores ahorrados por mes

source: Consumo por Mês (kWh)
es: Consumo por mes (kWh)

source: Km Rodados por Mês
es: Kilómetros recorridos por mes

source: Falha ao carregar dados mensais:
es: Error al cargar datos mensuales:

source: Não foi possível carregar os dados.
es: No se pudieron cargar los datos.

source: Sem dados para exibir.
es: Sin datos para mostrar.

source: pt-BR
es: es-ES

source: Custo Total (R$)
es: Custo Total ($)

source: Km no mês
es: Km mensuales

source: Economia Total (R$)
es: Economia Total ($)

source: Economia (Pagas) (R$)
es: Economia (Pagas) ($)

source: Nova Recarga
es: Nueva recarga

source: Histórico
es: Historial

source: Configurações
es: Configuraciones

source: Contato
es: Contacto

source: Sair
es: Salir

source: 2025 Gestão de Recargas
es: 2025 Gestión de Recargas

source: Gerenciar Recargas
es: Gestionar recargas

source: Observações
es: Observaciones

source: Isento
es: Exento

source: Sim
es: Sí

source: Não
es: No

source: Data início
es: Fecha inicio

source: Data fim
es: Fecha fin

source: Limpar
es: Limpiar

source: Últimos 30 dias
es: Últimos 30 días

source: Histórico de Recargas
es: Historial de recargas

source: Data
es: Fecha

source: Custo
es: Costo

source: Odômetro
es: Odómetro

source: Ações
es: Acciones

source: Exibindo
es: Mostrando

source: Próximo
es: Siguiente

source: Informe uma data válida.
es: Ingrese una fecha válida.

source: Informe um valor válido.
es: Ingrese un valor válido.

source: Salvar
es: Guardar

source: Confirmar Exclusão
es: Confirmar eliminación

source: Tem certeza que deseja excluir esta recarga? Essa ação não pode ser desfeita.
es: ¿Está seguro de que desea eliminar esta recarga? Esta acción no se puede deshacer.

source: Excluir
es: Eliminar

source: Erro ao carregar recargas.
es: Error al cargar recargas.

source: Nenhuma recarga encontrada.
es: No se encontró ninguna recarga.

source: Erro ao salvar edição.
es: Error al guardar la edición.

source: Recarga atualizada com sucesso!
es: ¡Recarga actualizada con éxito!

source: Erro ao excluir recarga.
es: Error al eliminar recarga.

source: Recarga excluída com sucesso!
es: ¡Recarga eliminada con éxito!

source: kWh Carregados
es: kWh cargados

source: Custo (R$)
es: Costo ($)

source: Odômetro (km)
es: Odómetro (km)

source: Nome
es: Nombre

source: Já tem conta?
es: ¿Ya tiene cuenta?

source: Faça login
es: Inicie sesión

source: Seu nome
es: Su nombre

source: seuemail@exemplo.com
es: suemail@ejemplo.com

source: Escreva sua mensagem
es: Escriba su mensaje

source: Ex.: Shopping
es: Ej.: Centro comercial

source: Ex.: garagem
es: Ej.: garaje

source: Mensagem
es: Mensaje
